app/Http/Controllers/Web/Frontend/GamesController.php

select * from `w_categories` where (`href` = 'arcade') limit 1
---
            \Illuminate\Support\Facades\Cookie::queue('currentCategory' . (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->id : 0), $category1, 2678400);
            if( $category1 != '' )
            {
                $cat1 = \VanguardLTE\Category::where(['href' => $category1])->first();

select `id` from `w_categories` where (`parent` = 0)
select `id` from `w_categories` where (`parent` = 24)
---
                    'hot'
                ]) )
                {
                    $categories = \VanguardLTE\Category::where(['parent' => 0])->pluck('id')->toArray();
                }
                else
                {
                    $categories = \VanguardLTE\Category::where(['parent' => $cat1->id])->pluck('id')->toArray();

select * from `w_jpg` where `shop_id` = 1
select sum(`balance`) as aggregate from `w_jpg` where `shop_id` = 1
---
                }
            }
            $games = $games->get();
            $jpgs = \VanguardLTE\JPG::where('shop_id', $shop_id)->get();
            $jpgSum = \VanguardLTE\JPG::where('shop_id', $shop_id)->sum('balance');

select * from `w_categories` where `id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29) order by `position` asc
---
                ])->pluck('original_id'))->groupBy('category_id')->pluck('category_id');
                if( count($cat_ids) )
                {
                    $categories = \VanguardLTE\Category::whereIn('id', $cat_ids)->orderBy('position', 'ASC')->get();

select * from `w_tournaments` where `shop_id` = 1 and `start` <= '2022-05-14 16:38:15' and `end` >= '2022-05-14 16:38:15' order by `end` asc limit 1
select * from `w_tournaments` where `shop_id` = 1 and `start` >= '2022-05-14 16:38:15' and `end` >= '2022-05-14 16:38:15' order by `end` asc limit 1
---
            {
                $currentSliderNum = 'hot';
            }
            $tournament = \VanguardLTE\Tournament::where('shop_id', $shop_id)->where('start', '<=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now())->orderBy('end', 'ASC')->first();
            if( !$tournament )
            {
                $tournament = \VanguardLTE\Tournament::where('shop_id', $shop_id)->where('start', '>=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now())->orderBy('end', 'ASC')->first();

select * from `w_stat_game` where `user_id` = 370 order by `date_time` desc limit 50
select * from `w_payments` where `user_id` = 370 order by `id` desc limit 50
---
            $depositlist = array();
            if(isset(auth()->user()->id))
            {
                $gamestat = \VanguardLTE\StatGame::where('user_id', auth()->user()->id)->orderByDesc('date_time')->limit(50)->get();
                $depositlist = \VanguardLTE\Payment::where('user_id', auth()->user()->id)->orderByDesc('id')->limit(50)->get();

select * from `w_subsessions` where (`subsession` = '691537' and `user_id` = 51) order by `created_at` desc limit 1
---
        public function server(\Illuminate\Http\Request $request, $game)
        {
            if( \Illuminate\Support\Facades\Auth::check() && !auth()->user()->hasRole('user') )
            {
                echo '{"responseEvent":"error","responseType":"start","serverResponse":"Wrong User"}';
                exit();
            }
            if( !\Illuminate\Support\Facades\Auth::check() )
            {
                echo '{"responseEvent":"error","responseType":"start","serverResponse":"User not Authorized"}';
                exit();
            }
            $subssession = \VanguardLTE\Subsession::where([
                'subsession' => $request->sessionId,
                'user_id' => auth()->user()->id
            ])->orderBy('created_at', 'desc')->first();